* 「それはいいことです。→大崎事件　裁判所が現場を訪れる意向示す」というジャーナリストの江川紹子氏のツイート
  :LOGBOOK:
  CLOCK: [2020-08-08 土 00:27]--[2020-08-08 土 00:51] =>  0:24
  :END:

:CATEGORIES: 再審請求,大崎事件

〉〉〉：Emacs： 2020-08-08（土曜日）00：27　 〉〉〉

　ジャーナリストの江川紹子氏のタイムラインで見たところですが，これはけっこう驚きの情報です。まだツイートの投稿時刻を確認していないのですが，他に情報はみていません。

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜amneris84（Shoko Egawa） 日時：2020-08-08 00:29／2020/08/07 21:51 URL： https://twitter.com/kk_hirono/status/1291758453564665858 https://twitter.com/amneris84/status/1291718584536674306  

> それはいいことです。→大崎事件　裁判所が現場を訪れる意向示す https://t.co/8baUOjamBA  

　21時51分のツイートとなっていますが，まだリンクの記事を開いていないので，これも記事の配信時刻が分かっていません。まとめ記事を作成する前提として，TwitterAPIでツイートを自動登録していますが，メッセージが出なくなったので処理が終わったようです。

```
2020年08月08日00時33分の実行記録
twitterAPI-search-lawList-mydql-add.rb "大崎事件"
ツイート数：11/1940 リツイート数：26/1940 トータル：140
hirono_hideki 0／1件
kk_hirono 2／0件
s_hirono 0／0件
```

　「ツイート数：11/1940 リツイート数：26/1940 トータル：140」という結果で，私のリツイートが1件，ツイートが2件となっています。法クラの反応としては多くも感じますが，トータルが140件というのは驚きの少なさです。

大崎事件　裁判所が現場を訪れる意向示す https://t.co/bQb1vXfkhp 2020.08.07 19:27

　そういえば日付が変わる頃から外で強い雨が降っている様子で，いくらか降り方が弱まってはいるのですが，雨が降り出す30分程前に銭湯から戻ってきたので際どいところでした。ようやく梅雨が明けた感じの天候になっていたので雨が降るとは全く考えていませんでした。

　夜の雨なので日照不足には無関係だと思いますが，このあとの天気予報もまだみておらず，ここ数日天気予報のことは気に掛けることもなかったので油断はできないと思いました。14時過ぎにテレビを消して，それからつけていなかった気がするのですが，他に集中していたのでよく憶えていません。

大崎事件　裁判所が現場を訪れる意向示す https://t.co/bQb1vXfkhp 2020.08.07 19:27

```
　一方、７日の審理の中で、裁判所が事件現場を訪れる意向を示したという。これは弁護団が裁判所に求めていたもので、事件が発生した１０月に実施できるよう調整しているという。裁判所が現場を訪れるのは１度目の再審請求以来で、弁護団は「裁判所の積極的な姿勢が伺えた」と手応えを語った。
　大崎事件弁護団の鴨志田祐美事務局長は「これだけ正面から裁判所が事件と向き合っているというだけで事件の冤罪性は否定しようがない。アヤコさんが生きているうちに判断を求めていきたい」と語った。
　弁護団は、被害者の死因は絞殺ではなく自転車の転落による事故死と主張しているが、今後当時の状況を再現した３Ｄ映像を制作する予定だという。
　事件から４１年。迅速な審理が求められる。

［source：］大崎事件　裁判所が現場を訪れる意向示す https://www.kyt-tv.com/nnn/news16346133.html?fbclid=IwAR2ZYRLfS5ueF7gdaF6gBMexNESebj-fE_flcxeok9IUge3uxu2Gq4MvAT4
```

　警察の現場検証とは違うのかと思いますが，再審の裁判で裁判所の現場検証があったと知ったのも最近のことで，再審のイメージに変化があったのですが，再審請求で裁判所の現場検証というのはさらに珍しく感じ，大崎事件では前にも再審請求であったことで2回目とあります。

　「弁護団は、被害者の死因は絞殺ではなく自転車の転落による事故死と主張」という点が今回の第4次再審請求では強調されていますが，それでは前の再審請求は何だったのかという疑問が膨らみ，再審開始となればさらに弁護士に対する不信や疑問が大きくなりそうです。

〈〈〈：Emacs： 2020-08-08（土曜日）00：51 　〈〈〈

* 大崎事件をキーワードに含む，主に法クラの弁護士らのツイートの検索記録（2020年8月8日0時）
  :LOGBOOK:
  CLOCK: [2020-08-08 土 00:58]--[2020-08-08 土 01:32] =>  0:34
  :END:

:CATEGORIES: 大崎事件

〉〉〉：Emacs： 2020-08-08（土曜日）00：58　 〉〉〉

　日付が変わっているので一昨日になりそうですが，けっこう長い間，使うことのなかったスクリプトを使うようになりました。使ってみるとエラーが出て修正にしばらく時間が掛かっていました。他とはメソッドが違って，取得できるツイートが少なかったのですが，今回はけっこうありました。

　スクリプトの出力は他とは違って，次のようになっています。さきほど実行した実際の処理結果になります。

```
アクセス可能回数 179
リセット時間 2020/08/08 01:07:54
リセット時間 （残り秒数に換算） 745.0



ajx-all-user-mysql-REGEXP_blogger_hirono2014sk.rb "大崎事件"
ajx-all-user-mysql-REGEXP_blogger_hirono2014sk.rb "大崎事件" "`date +"%Y-%m-%d %H:%M" --date "7 day ago"`/`date +"%Y-%m-%d %H:%M"`"
ajx-all-user-mysql-REGEXP_blogger_hirono2014sk.rb "大崎事件" "`date +"%Y-%m-%d %H:%M" --date "3 day ago"`/`date +"%Y-%m-%d %H:%M"`"
ajx-all-user-mysql-REGEXP_blogger_hirono2014sk.rb "大崎事件" "`date +"%Y-%m-%d %H:%M" --date "1 day ago"`/`date +"%Y-%m-%d %H:%M"`"
```

　実際は3行になっているのですが，1行でまとめると，「アクセス可能回数 179　リセット時間 2020/08/08 01:07:54　リセット時間 （残り秒数に換算） 745.0」となっています。これはプログラム言語がpythonのスクリプトになります。

 - 2020年08月08日01時05分の登録： REGEXP：”大崎事件”／データベース登録済みツイートの検索：2020-08-07〜2020-08-08／2020年08月08日01時04分の記録：ユーザ・投稿：18／23件 http://hirono2014sk.blogspot.com/2020/08/regexp2020-08-072020-08.html

　今回は瞬間で埋め込みツイートが表示され驚いたのですが，市川寛弁護士のツイートも埋め込みツイートが表示されたので驚きました。まさかと思いながら個別にツイートを開いてみるとブロックされている時のメッセージが出ていました。

 - （01／23） TW KYT_4chNEWS（鹿児島 KYT ニュース） 日時： 2020-08-07 20:25:00 +0900 URL： https://twitter.com/KYT_4chNEWS/status/1291697063193788417

> 【大崎事件 裁判所が現場を訪れる意向示す】
> ４度目の再審請求を行っている #大崎事件 で、２回目の審理が行われました。
> https://t.co/HhBKLVMAxq

 - （02／23） TW kamo629782（かもん弓（鴨志田 祐美）） 日時： 2020-08-07 20:33:00 +0900 URL： https://twitter.com/kamo629782/status/1291699024454541313

> 大崎事件第４次再審・２回目の進行協議期日で、裁判所は事件発生時と同じ１０月に現地を直接見に行くことを表明しました。
> 鹿児島地裁の裁判官が事件現場を訪れるのは、第１次再審以来２４年ぶりのこと。
>
> この事件に向き合う裁判所の「本気度」… https://t.co/8ppP1xPt2B

 - （03／23） TW imarockcaster42（弁護士 市川 寛） 日時： 2020-08-07 20:39:00 +0900 URL： https://twitter.com/imarockcaster42/status/1291700595426856960

> 大崎事件　裁判所が現場を訪れる意向示す https://t.co/s8g4hbqdYY

 - （08／23） TW amneris84（Shoko Egawa） 日時： 2020-08-07 21:51:00 +0900 URL： https://twitter.com/amneris84/status/1291718584536674306

> それはいいことです。→大崎事件　裁判所が現場を訪れる意向示す https://t.co/8baUOjamBA

 - （09／23） RT 1961kumachin（中村元弥）｜amneris84（Shoko Egawa） 日時：2020-08-07 22:21:00 +0900／2020-08-07 21:51:00 +0900 URL： https://twitter.com/1961kumachin/status/1291726102436524032 https://twitter.com/amneris84/status/1291718584536674306
それはいいことです。→大崎事件　裁判所が現場を訪れる意向示す https://t.co/8baUOjamBA

 - （10／23） TW 1961kumachin（中村元弥） 日時： 2020-08-07 22:25:00 +0900 URL： https://twitter.com/1961kumachin/status/1291727205739802624

> 「当時と同じ１０月中には現場を訪れる考え」　期待したいところである
>
> 大崎事件の再審請求２回目の協議｜NHK 鹿児島県のニュース https://t.co/0XQ3WAOMWA

　最近は法クラのタイムラインでリツイートを見かけることが少なくなっているとも感じる中村元弥弁護士ですが，元裁判官でもあるので，裁判官のままであればどれだけ無罪判決を出していたのかと想像するところがあり，ジャーナリストの江川紹子氏に疑問もなさそうです。

 - （17／23） TW shogoshibahara（芝原章吾） 日時： 2020-08-07 23:26:00 +0900 URL： https://twitter.com/shogoshibahara/status/1291742569014075395

> 大崎事件の再審請求２回目の協議｜NHK 鹿児島県のニュース https://t.co/7DvHzoUdIW

　上記の芝原章吾というTwitterアカウントもしばらくツイートを見かけず，忘れていたところがあるのですが，プロフィールに鹿児島の弁護士とあったと思います。間もあるので100％の確信が持てないので，次に確認をします。

```
芝原章吾
@shogoshibahara
弁護士／芝原総合法律事務所代表／鹿児島県弁護士会所属
鹿児島市2017年10月からTwitterを利用しています
134 フォロー中
1,426 フォロワー

［source：］(3) 芝原章吾さん (@shogoshibahara) / Twitter https://twitter.com/shogoshibahara?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1291742569014075395%7Ctwgr%5E&ref_url=http%3A%2F%2Fhirono2014sk.blogspot.com%2F2020%2F08%2Fregexp2020-08-072020-08.html
```

　思い出すことはなかったのですが，地蔵の頭なのか地蔵を象った薬缶なのかよくわからない横に青色のアジサイのあるヘッダ画像の写真が出てきました。芝原総合法律事務所とありますが，これは何度見ても東京都の芝浦と勘違いしてしまいます。

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜shogoshibahara（芝原章吾） 日時：2020-08-08 01:23／2020/08/07 23:26 URL： https://twitter.com/kk_hirono/status/1291772055277338625 https://twitter.com/shogoshibahara/status/1291742569014075395  

> 大崎事件の再審請求２回目の協議｜NHK 鹿児島県のニュース https://t.co/7DvHzoUdIW  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜shogoshibahara（芝原章吾） 日時：2020-08-08 01:24／2020/08/07 09:34 URL： https://twitter.com/kk_hirono/status/1291772117902438401 https://twitter.com/shogoshibahara/status/1291533156793724928  

> 港区議を公然わいせつ容疑で逮捕　高校生に下半身露出か（朝日新聞デジタル） https://t.co/qeN0L04xrN  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜shogoshibahara（芝原章吾） 日時：2020-08-08 01:24／2020/08/07 01:08 URL： https://twitter.com/kk_hirono/status/1291772255157071880 https://twitter.com/shogoshibahara/status/1291405844173606913  

> 木村花さん母、誹謗中傷した人に法的措置を検討 「法律の壁など、色々なハードルがある」【一問一答】 | ハフポスト https://t.co/XdKQiXzpKO  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜shogoshibahara（芝原章吾） 日時：2020-08-08 01:24／2020/08/06 09:48 URL： https://twitter.com/kk_hirono/status/1291772327265361920 https://twitter.com/shogoshibahara/status/1291174163223371779  

> 僕はイソジン報道見ていないし製薬業界に詳しいわけではないけど、多分そうじゃないかなと思いイソジンの販売会社をちょっとネットで調べてみたらやっぱり大阪の会社だった。たまたまなんだろうけどね。  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜shogoshibahara（芝原章吾） 日時：2020-08-08 01:25／2020/08/05 09:33 URL： https://twitter.com/kk_hirono/status/1291772442105360384 https://twitter.com/shogoshibahara/status/1290808126128627713  

> 弁護士への委任につき法定代理人の同意は不要と思います。 https://t.co/jkWoB30Iz3  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜shogoshibahara（芝原章吾） 日時：2020-08-08 01:25／2020/08/05 02:32 URL： https://twitter.com/kk_hirono/status/1291772501857431552 https://twitter.com/shogoshibahara/status/1290702074145955840  

> 余談だが、テラス（委託援助かな？確かそう）使って告訴したことある？着手金激安だよね。確か6万くらいだったと思う。当然、報酬なんぞあるわけがない。  

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜shogoshibahara（芝原章吾） 日時：2020-08-08 01:25／2020/08/05 02:17 URL： https://twitter.com/kk_hirono/status/1291772580198674434 https://twitter.com/shogoshibahara/status/1290698317005897728  

> 「闘う相手は人間ではなくウイルス」コロナ感染者らへの中傷が相次ぐ中、ある市が出した宣言とは（BuzzFeed Japan） https://t.co/tYsjVwGKKx  


　たぶんブラウザのブックマークには登録していると思うのですが，直接タイムラインを開くことはあまりないアカウントで，定期的に他の法クラのタイムラインでリツイートされたものを見かけ，そのときにリンクのタイムラインも開いていました。

　けっこう参考になる有用なツイートのあるアカウントなのだと思いを新たにしました。

　まとめ記事は23件中，21件目以降が私のツイートとなっていました。日付が変わる前，一太郎マクロの有用な情報をようやく見つけ，日付が変わってday-ago-script.shを実行し，すぐにWindows10を起動するつもりでいました。7日は起動しなかったWindows10です。

〈〈〈：Emacs： 2020-08-08（土曜日）01：32 　〈〈〈

* ようやく見つけた一太郎マクロで，カーソルがある段落のテキストを取得する関数
  :LOGBOOK:
  CLOCK: [2020-08-08 土 23:05]--[2020-08-08 土 23:54] =>  0:49
  :END:

:CATEGORIES: パソコン

〉〉〉：Emacs： 2020-08-08（土曜日）23：05　 〉〉〉

▶▶▶　kk_hironoのリツイート　▶▶▶  

- RT kk_hirono（刑事告発・非常上告＿金沢地方検察庁御中）｜hirono_hideki（奉納＼さらば弁護士鉄道・泥棒神社の物語） 日時：2020-08-08 23:07／2020/08/08 11:43 URL： https://twitter.com/kk_hirono/status/1292100067340382209 https://twitter.com/hirono_hideki/status/1291927948996435968  

> 一太郎マクロ | こだわり探求隊 https://t.co/nNEEPaplsM  %Str = GetCsvItem(1) MsgBox(%Str）  

　「GetCsvItem(1)」という関数のようですが，情報を見つけた記事には，「カーソル位置の段落をCSV形式と見なし、指定された位置の文字列を取得します。」という説明があります。

　CSVというのは区切り文字で表計算の原形のようなテキストファイルという理解でいますが，どうも一太郎では表敬式でテキストを扱う仕組みがあるように思われます。

　1という引数を入れないと，引数がないというエラーが出ていたのですが，１と引数を入れてみたところ段落のテキストというか文字列の取得ができました。区切りがなくてもCSVで1番目の絡むという扱いになるようです。

　ずいぶんややこしく感じて，なかなか情報が見つからなかったのも納得でしたが，これで段落の文字数を計算することも出来るようになりました。

　記事には一太郎のマクロと思われる沢山の関数が掲載されていて，文字列でページ内検索をしながらようやくそれらしい関数を見つけることができました。

　単純に段落の文字列を取得できる関数名があってもよさそうですが，段落を意味するParagraphで他にそれらしい関数は見当たりません。なぜこんなに分かりづらくしているのか疑問で，ずいぶんと時間を無駄にさせられたという不満もあります。

　エディタでは行が，ワープロソフトでは文をまとめた段落という概念，取り扱いの違いもあるようですが，調べて簡単に見つかる情報ではなく，なぜこんなにややこしくなっているのか疑問で，エディタではとても簡単な操作になります。

```
  (let ((sp  (point))
        (ep nil))
    (end-of-line)
    (setq ep (point))
    (setq text (buffer-substring sp ep)) 
```

　EmacsでのEmacs-Lispのカレント行の文字列の取得が，上記のコードになりますが，一つの関数にはなっておらず，これもややこしいかもしれません。行頭と行末のポイント位置を取得し，その範囲の文字列を取得しています。

　以前は簡単に出来るものが普通だったという感覚があって，Vimのscriptで調べたところ，「getline('.')」でカーソル業の文字列の取得ができました。テキスト処理の基本中の基本と思うのですが，このテキスト処理の需要と情報が乏しいのが不思議です。

〈〈〈：Emacs： 2020-08-08（土曜日）23：54 　〈〈〈
